tutorials/Coupled/2D_example_PNPNSFoam_Sang_clone/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     N-S-PNPDImlessFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2; // 1;
deltaT          1;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
libs ("libfixedIonicFlux.so" "libmodifiedFixedValue.so" "libslipSmoluchowski.so");
nNewtonIteration 15; //15;
nNSPNPIteration  100;
C1C2convergence  1e-3; //1e-3;
PNPNStransient no;
solveNS yes;
saveVtkFiles no;
saveDesaltPhysics no;
// ************************************************************************* //
