tutorials/Coupled/2D_example_PNPNSFoam_Sang_clone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    top
    {
        type            patch;
        nFaces          60;
        startFace       13744;
    }
    bottom
    {
        type            patch;
        nFaces          60;
        startFace       13804;
    }
    wall
    {
        type            patch;
        nFaces          232;
        startFace       13864;
    }
    frontAndBack
    {
        type            empty;
        nFaces          13920;
        startFace       14096;
    }
)


// ************************************************************************* //
